#英文を暗号化するプログラム
number = int(input('何回この暗号作成解読器を使いたいですか->'))
for x in range(number):
    code = {'a': 'あ', 'b': 'い', 'c': 'う', 'd': 'え', 'e': 'を', 'f': 'お', 'g': 'か', 'h': 'き',
            'i': 'け', 'j': 'こ', 'k': 'さ','l': 'し', 'm': 'す', 'n': 'せ', 'o': 'そ', 'p': 'た', 
            'q': 'ち', 'r': 'つ', 's': 'て', 't': 'と', 'u': 'な', 'v': 'に', 'w': 'ね', 'x': 'の', 
            'y': 'や', 'z': 'ゆ', 'A': 'よ', 'B': 'ア', 'C': 'イ', 'D': 'ウ', 'E': 'エ', 'F': 'オ', 
            'G': 'カ', 'H': 'キ', 'I': 'ク', 'J': 'ケ', 'K': 'コ', 'L': 'サ', 'M': 'シ', 'N': 'ス', 
            'O': 'セ', 'P': 'ソ', 'Q': 'タ', 'R': 'チ', 'S': 'ツ', 'T': 'テ', 'U': 'ト', 'V': 'ナ', 
            'W': 'ニ', 'X': 'ヌ', 'Y': 'ネ', 'Z': 'ノ', '.': '漢', ',': '女', ' ': '白'}
    reverse_code = {'あ': 'a', 'い': 'b', 'う': 'c', 'え': 'd', 'を': 'e', 'お': 'f', 'か': 'g', 'き': 'h',
                    'け': 'i', 'こ': 'j', 'さ': 'k', 'し': 'l', 'す': 'm', 'せ': 'n', 'そ': 'o', 'た': 'p', 
                    'ち': 'q', 'つ': 'r', 'て': 's', 'と': 't', 'な': 'u', 'に': 'v', 'ね': 'w', 'の': 'x', 
                    'や': 'y', 'ゆ': 'z', 'よ': 'A', 'ア': 'B', 'イ': 'C', 'ウ': 'D', 'エ': 'E', 'オ': 'F', 
                    'カ': 'G', 'キ': 'H', 'ク': 'I', 'ケ': 'J', 'コ': 'K', 'サ': 'L', 'シ': 'M', 'ス': 'N', 
                    'セ': 'O', 'ソ': 'P', 'タ': 'Q', 'チ': 'R', 'ツ': 'S', 'テ': 'T', 'ト': 'U', 'ナ': 'V', 
                    'ニ': 'W', 'ヌ': 'X', 'ネ': 'Y', 'ノ': 'Z', '漢': '.', '女': ',', '白': ' '}
    answer = str(input('英文を暗号化したければ「はい」、そうでなければ「いいえ」を入力->'))
    if answer == 'はい':
        sentence = str(input('半角英文を入力->'))
        sentence_list = []
        for a in sentence:
            sentence_list.append(str((code[a])))
        print('暗号化した英文を表示↓')
        print(''.join(sentence_list))
#暗号化した英文を翻訳
    ans = str(input('暗号化された英文を解読したければ「はい」、そうでなければ「いいえ」を入力->')) 
    if ans == 'はい':    
        b = str(input('暗号化された英文を入力->'))
        translation_sentence = []
        for c in b:
            translation_sentence.append(reverse_code[c])
        print('解読した英文を表示↓')
        print(''.join(translation_sentence))